stubs/libxml2/samples/5980f180b7d42adabb3f803fa6cc74c78721c391

<log:log toolkit="XBinder_v1.4" examples="http://www.w3.org/2002/ws/databinding/examples/6/09/" datetime="2008-03-11 16:50:17 UTC" xmlns:log="http://www.w3.org/2002/ws/databinding/log/6/09/" xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/"><log:call example="AnySimpleTypeElement" instance="AnySimpleTypeElement01"><log:request><log:head><![CDATA[
POST http://127.0.0.1:9123
User-Agent: databinding tester
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.w3.org/2002/ws/databinding/examples/6/09/#echoAnySimpleTypeElement"
]]></log:head><log:body><?_xml version="1.0" encoding="UTF-8"?><!--
                    
                    Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.
                    W3C liability, trademark and document use rules apply.
                    
                    http://www.w3.org/Consortium/Legal/ipr-notice
                    http://www.w3.org/Consortium/Legal/copyright-documents
                    
		    Generated from: $Id: output.xml,v 1.1 2008/03/12 13:53:26 gcowe Exp $
-->
<env:Envelope xmlns:p="http://www.w3.org/2002/ws/databinding/patterns/6/09/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/">
   <env:Header/>
   <env:Body>
      <ex:echoAnySimpleTypeElement>
         <ex:anySimpleTypeElement xmlns:wsdl11="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/"/>
      </ex:echoAnySimpleTypeElement>
   </env:Body>
</env:Envelope>
</log:body></log:request><log:response><log:head><![CDATA[
HTTP/0.9 200 Assumed OK
Client-Date: Tue, 11 Mar 2008 16:50:18 GMT
Client-Peer: 127.0.0.1:9123
Client-Response-Num: 1
]]></log:head><log:body>POST / HTTP/1.1
Host: 127.0.0.1:9123
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.w3.org/2002/ws/databinding/examples/6/09/#echoAnySimpleTypeElement"
Content-Length: 429
Connection: close

<?_xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns="http://www.w3.org/2002/ws/databinding/examples/6/09/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Body>
      <ns:echoAnySimpleTypeElement>
         <ns:anySimpleTypeElement></ns:anySimpleTypeElement>
      </ns:echoAnySimpleTypeElement>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
</log:body></log:response></log:call><log:call example="AnySimpleTypeElement" instance="AnySimpleTypeElement02"><log:request><log:head><![CDATA[
POST http://127.0.0.1:9123
User-Agent: databinding tester
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.w3.org/2002/ws/databinding/examples/6/09/#echoAnySimpleTypeElement"
]]></log:head><log:body><?_xml version="1.0" encoding="UTF-8"?><!--
                    
                    Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.
                    W3C liability, trademark and document use rules apply.
                    
                    http://www.w3.org/Consortium/Legal/ipr-notice
                    http://www.w3.org/Consortium/Legal/copyright-documents
                    
		    Generated from: $Id: output.xml,v 1.1 2008/03/12 13:53:26 gcowe Exp $
-->
<env:Envelope xmlns:p="http://www.w3.org/2002/ws/databinding/patterns/6/09/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/">
   <env:Header/>
   <env:Body>
      <ex:echoAnySimpleTypeElement>
         <ex:anySimpleTypeElement xmlns:wsdl11="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/">anySimpleTypeValue</ex:anySimpleTypeElement>
      </ex:echoAnySimpleTypeElement>
   </env:Body>
</env:Envelope>
</log:body></log:request><log:response><log:head><![CDATA[
HTTP/0.9 200 Assumed OK
Client-Date: Tue, 11 Mar 2008 16:50:18 GMT
Client-Peer: 127.0.0.1:9123
Client-Response-Num: 1
]]></log:head><log:body>POST / HTTP/1.1
Host: 127.0.0.1:9123
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://www.w3.org/2002/ws/databinding/examples/6/09/#echoAnySimpleTypeElement"
Content-Length: 447
Connection: close

<?_xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns="http://www.w3.org/2002/ws/databinding/examples/6/09/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Body>
      <ns:echoAnySimpleTypeElement>
         <ns:anySimpleTypeElement>anySimpleTypeValue</ns:anySimpleTypeElement>
      </ns:echoAnySimpleTypeElement>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
</log:body></log:response></log:call><log:call example="AnyTypeElement" instance="AnyTypeElement01"><log:request><log:head><![CDATA[
POST http://127.0.0.1:9123